<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"f81f3535bfc1e720b24b3dda7598629609ebae64355667eafaeeb7fe0455a804","plan_job_ref":"Job Create PR TF Plan comment #11 at https://github.com/RuneORakeie/sqlkonferenz2025/actions/runs/13540566396","plan_out_hash":"b7d7e1ba5c193d42d5dc557458f2afe56b27e63ed15bce482293458d252a6d33","plan_hash":"d8705f69304ae94cb71089d8070bbc6acfbf9a87de220e4997712c44c5eabca3","plan_text_format":"diff","version":"1.46.1","closed":true} -->
Terraform plan in __./tf_restore__
With backend config: `resource_group_name=ClauseFabric storage_account_name=tfsamsfabrictfstate container_name=tfstate key=terraform-msfabric-restore-demo.tfstate`<details open><summary>With variables</summary>

```hcl
admin_user        = (sensitive value)
admin_user2       = (sensitive value)
azeventhub_saskey = (sensitive value)
client_id         = (sensitive value)
client_secret     = (sensitive value)
tenant_id         = (sensitive value)
```
</details>
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.demo_ws_prod_restore.fabric_workspace.fab_ws will be created
+   resource "fabric_workspace" "fab_ws" {
+       capacity_assignment_progress = (known after apply)
+       capacity_id                  = "************************************"
+       capacity_region              = (known after apply)
+       description                  = "SQLK2025 - RTI demo workspace"
+       display_name                 = "datamonster - WS"
+       id                           = (known after apply)
+       identity                     = {
+           application_id       = (known after apply)
+           service_principal_id = (known after apply)
+           type                 = "SystemAssigned"
        }
+       onelake_endpoints            = (known after apply)
+       type                         = (known after apply)
    }

  # module.demo_ws_prod_restore.fabric_workspace_role_assignment.fab_ws_role_assign["0"] will be created
+   resource "fabric_workspace_role_assignment" "fab_ws_role_assign" {
+       id             = (known after apply)
+       principal_id   = "************************************"
+       principal_type = "Group"
+       role           = "Contributor"
+       workspace_id   = (known after apply)
    }

  # module.demo_ws_prod_restore.fabric_workspace_role_assignment.fab_ws_role_assign["1"] will be created
+   resource "fabric_workspace_role_assignment" "fab_ws_role_assign" {
+       id             = (known after apply)
+       principal_id   = "************************************"
+       principal_type = "User"
+       role           = "Admin"
+       workspace_id   = (known after apply)
    }

  # module.demo_ws_prod_restore.fabric_workspace_role_assignment.fab_ws_role_assign["2"] will be created
+   resource "fabric_workspace_role_assignment" "fab_ws_role_assign" {
+       id             = (known after apply)
+       principal_id   = "************************************"
+       principal_type = "User"
+       role           = "Admin"
+       workspace_id   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Preview mode enabled

  with provider["registry.terraform.io/microsoft/fabric"],
  on provider.tf line 20, in provider "fabric":
  20: provider "fabric" {

Features available in preview mode are not yet generally available and may
change without notice include breaking changes. Production use is not
recommended. Use at your own risk!
```
</details>

:white_check_mark: Plan applied in [Terraform CD - Restore #10](https://github.com/RuneORakeie/sqlkonferenz2025/actions/runs/13540627747)